Revit 2024 API
ZJustification Enumeration
 The justification of the framing element in Z.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Since: 2014
Syntax
C#
public enum ZJustification
Visual Basic
Public Enumeration ZJustification
Visual C++
public enum class ZJustification
Members
Member name | Description
Top |  Justification to the top of the element.
Center |  Justification to the geometrical center of element.
Origin |  Justification to the origin of the element.
Bottom |  Justification to the bottom of the element.
See Also
Autodesk.Revit.DB.Structure Namespace